Revit 2026 API

# DirectContext3DHandleSettings Class

---

Overriding settings applied to DirectContext3DHandles through the Visibility dialog.

SystemObject Autodesk.Revit.DB.DirectContext3DDirectContext3DHandleSettings

**Namespace:** Autodesk.Revit.DB.DirectContext3D**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class DirectContext3DHandleSettings : IDisposable
```
```vb
Public Class DirectContext3DHandleSettings
	Implements IDisposable
```
```cpp
public ref class DirectContext3DHandleSettings : IDisposable
```
```fsharp
type DirectContext3DHandleSettings =
    class
        interface IDisposable
    end
```

The DirectContext3DHandleSettings type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | DirectContext3DHandleSettings | Constructs an instance of settings with default values. |
|  | DirectContext3DHandleSettings(DirectContext3DHandleSettings) | Constructs a copy of source object. |
|  | DirectContext3DHandleSettings(Boolean, Int32) | Constructs an instance of settings with provided values. |

|  | Name | Description |
| --- | --- | --- |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
|  | Visibility | Visibility of the handle and the associated DirectContext3D graphics. A value of true means that the graphics are visible. |

|  | Name | Description |
| --- | --- | --- |
|  | Assign | Assigns values of the source settings to this object. |
|  | Dispose | Releases all resources used by the DirectContext3DHandleSettings |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetColor | Gets the color of the handle and the associated DirectContext3D graphics. |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetTransparency | Gets the transparency value of the handle and the associated DirectContext3D graphics. |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | IsEqual | Check if the contents of two instances of settings are equal. |
|  | SetColor | Sets the color of the handle and the associated DirectContext3D graphics. |
|  | SetTransparency | Sets the transparency value of the handle and the associated DirectContext3D graphics. |
|  | SetVisibility | Visibility of the handle and the associated DirectContext3D graphics. A value of true means that the graphics are visible. |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

DirectContext3D graphics can be displayed with or without an associated DirectContext3D handle element. For DirectContext3D graphics that utilize the handle element, the visibility and appearance of the graphics can be adjusted through the Visibility/Graphics dialog.

#### Reference

Autodesk.Revit.DB.DirectContext3D Namespace